cfd/openfoam/11_simpleFoam/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// ************************************************************************** //

#include "include/controlVolume"

// ************************************************************************** //

convertToMeters 1.0;

// ************************************************************************** //

vertices
(
    ( $controlVol_x_min   $controlVol_y_min  $controlVol_z_min )
    ( $mainSection_x_min  $controlVol_y_min  $controlVol_z_min )
    ( $mainSection_x_max  $controlVol_y_min  $controlVol_z_min )
    ( $controlVol_x_max   $controlVol_y_min  $controlVol_z_min )
    ( $controlVol_x_min                 0.0  $controlVol_z_min )
    ( $mainSection_x_min                0.0  $controlVol_z_min )
    ( $mainSection_x_max                0.0  $controlVol_z_min )
    ( $controlVol_x_max                 0.0  $controlVol_z_min )
    ( $controlVol_x_min   $controlVol_y_max  $controlVol_z_min )
    ( $mainSection_x_min  $controlVol_y_max  $controlVol_z_min )
    ( $mainSection_x_max  $controlVol_y_max  $controlVol_z_min )
    ( $controlVol_x_max   $controlVol_y_max  $controlVol_z_min )
    ( $controlVol_x_min   $controlVol_y_min                0.0 )
    ( $mainSection_x_min  $controlVol_y_min                0.0 )
    ( $mainSection_x_max  $controlVol_y_min                0.0 )
    ( $controlVol_x_max   $controlVol_y_min                0.0 )
    ( $controlVol_x_min                 0.0                0.0 )
    ( $mainSection_x_min                0.0                0.0 )
    ( $mainSection_x_max                0.0                0.0 )
    ( $controlVol_x_max                 0.0                0.0 )
    ( $controlVol_x_min   $controlVol_y_max                0.0 )
    ( $mainSection_x_min  $controlVol_y_max                0.0 )
    ( $mainSection_x_max  $controlVol_y_max                0.0 )
    ( $controlVol_x_max   $controlVol_y_max                0.0 )
    ( $controlVol_x_min   $controlVol_y_min  $controlVol_z_max )
    ( $mainSection_x_min  $controlVol_y_min  $controlVol_z_max )
    ( $mainSection_x_max  $controlVol_y_min  $controlVol_z_max )
    ( $controlVol_x_max   $controlVol_y_min  $controlVol_z_max )
    ( $controlVol_x_min                 0.0  $controlVol_z_max )
    ( $mainSection_x_min                0.0  $controlVol_z_max )
    ( $mainSection_x_max                0.0  $controlVol_z_max )
    ( $controlVol_x_max                 0.0  $controlVol_z_max )
    ( $controlVol_x_min   $controlVol_y_max  $controlVol_z_max )
    ( $mainSection_x_min  $controlVol_y_max  $controlVol_z_max )
    ( $mainSection_x_max  $controlVol_y_max  $controlVol_z_max )
    ( $controlVol_x_max   $controlVol_y_max  $controlVol_z_max )
);

// ************************************************************************** //

blocks
(
    // inlet section
    hex (  0  1  5  4 12 13 17 16 ) ( $numberOfCellsInlet_x $numberOfCells_y $numberOfCells_z ) simpleGrading ( $gradingInlet_x 1.0 1.0 )
    hex (  4  5  9  8 16 17 21 20 ) ( $numberOfCellsInlet_x $numberOfCells_y $numberOfCells_z ) simpleGrading ( $gradingInlet_x 1.0 1.0 )
    hex ( 12 13 17 16 24 25 29 28 ) ( $numberOfCellsInlet_x $numberOfCells_y $numberOfCells_z ) simpleGrading ( $gradingInlet_x 1.0 1.0 )
    hex ( 16 17 21 20 28 29 33 32 ) ( $numberOfCellsInlet_x $numberOfCells_y $numberOfCells_z ) simpleGrading ( $gradingInlet_x 1.0 1.0 )
    
    // main section
    hex (  1  2  6  5 13 14 18 17 ) ( $numberOfCellsMain_x $numberOfCells_y $numberOfCells_z ) simpleGrading ( 1.0 1.0 1.0 )
    hex (  5  6 10  9 17 18 22 21 ) ( $numberOfCellsMain_x $numberOfCells_y $numberOfCells_z ) simpleGrading ( 1.0 1.0 1.0 )
    hex ( 13 14 18 17 25 26 30 29 ) ( $numberOfCellsMain_x $numberOfCells_y $numberOfCells_z ) simpleGrading ( 1.0 1.0 1.0 )
    hex ( 17 18 22 21 29 30 34 33 ) ( $numberOfCellsMain_x $numberOfCells_y $numberOfCells_z ) simpleGrading ( 1.0 1.0 1.0 )
    
    // outlet section
    hex (  2  3  7  6 14 15 19 18 ) ( $numberOfCellsOutlet_x $numberOfCells_y $numberOfCells_z ) simpleGrading ( $gradingOutlet_x 1.0 1.0 )
    hex (  6  7 11 10 18 19 23 22 ) ( $numberOfCellsOutlet_x $numberOfCells_y $numberOfCells_z ) simpleGrading ( $gradingOutlet_x 1.0 1.0 )
    hex ( 14 15 19 18 26 27 31 30 ) ( $numberOfCellsOutlet_x $numberOfCells_y $numberOfCells_z ) simpleGrading ( $gradingOutlet_x 1.0 1.0 )
    hex ( 18 19 23 22 30 31 35 34 ) ( $numberOfCellsOutlet_x $numberOfCells_y $numberOfCells_z ) simpleGrading ( $gradingOutlet_x 1.0 1.0 )
);

// ************************************************************************** //

edges
(
);

// ************************************************************************** //

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (  0 12 16  4 )
            (  4 16 20  8 )
            ( 12 24 28 16 )
            ( 16 28 32 20 )
        );
    }
    
    outlet
    {
        type patch;
        faces
        (
            (  3  7 19 15 )
            (  7 11 23 19 )
            ( 15 19 31 27 )
            ( 19 23 35 31 )
        );
    }
    
    walls
    {
        type patch;
        faces
        (
            // left
            (  0  1 13 12 ) 
            ( 12 13 25 24 )
            (  1  2 14 13 )
            ( 13 14 26 25 )
            (  2  3 15 14 )
            ( 14 15 27 26 )

            // right
            (  8 20 21  9 ) 
            ( 20 32 33 21 )
            (  9 21 22 10 )
            ( 21 33 34 22 )
            ( 10 22 23 11 )
            ( 22 34 35 23 )
            
            // bottom
            (  0  4  5  1 ) 
            (  4  8  9  5 )
            (  1  5  6  2 )
            (  5  9 10  6 )
            (  2  6  7  3 )
            (  6 10 11  7 )
            
            // top
            ( 24 25 29 28 ) 
            ( 28 29 33 32 )
            ( 25 26 30 29 )
            ( 29 30 34 33 )
            ( 26 27 31 30 )
            ( 30 31 35 34 )
        );
    }
);

// ************************************************************************** //

mergePatchPairs
(
);

// ************************************************************************** //
