cfd/openfoam/11_simpleFoam/system/include/materialPoint
// ************************************************************************** //
// Material point coordinates
// ************************************************************************** //

materialPnt_x -15.0000001;
materialPnt_y -15.0000001;
materialPnt_z -15.0000001;

// ************************************************************************** //
